[Killed] LogicalOperator
main/components/UCSBOrganization/UCSBOrganizationForm.js:11:24
         formState: { errors },
         handleSubmit,
     } = useForm({
-        defaultValues: initialContents || {},
+        defaultValues: initialContents && {},
     });
 
killedBy: UCSBOrganizationForm tests renders correctly when passing in initialContents
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "AS"
Received: ""

[Killed] ConditionalExpression
main/components/UCSBOrganization/UCSBOrganizationForm.js:11:24
         formState: { errors },
         handleSubmit,
     } = useForm({
-        defaultValues: initialContents || {},
+        defaultValues: false,
     });
 
killedBy: UCSBOrganizationForm tests renders correctly when passing in initialContents
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "AS"
Received: ""

[Killed] ObjectLiteral
main/components/UCSBOrganization/UCSBOrganizationForm.js:26:45
                     id="orgCode"
                     type="text"
                     isInvalid={Boolean(errors.orgCode)}
-                    {...register("orgCode", {
-                        required: "orgCode is required.",
-                        maxLength: {
-                            value: 30,
-                            message: "Max length 30 characters",
-                        },
-                    })}
+                    {...register("orgCode", {})}
                 />
                 <Form.Control.Feedback type="invalid">
killedBy: UCSBOrganizationForm tests validates orgCode field correctly
statusReason: Error: Unable to find an element with the text: /orgCode is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div
