[Killed] LogicalOperator
main/components/HelpRequest/HelpRequestForm.js:33:18
 
             <Row>
 
-                {initialContents && (
-                    <Col>
-                        <Form.Group className="mb-3" >
-                            <Form.Label htmlFor="id">Id</Form.Label>
-                            <Form.Control
-                                data-testid="HelpRequestForm-id"
-                                id="id"
-                                type="text"
-                                {...register("id")}
-                                value={initialContents.id}
-                                disabled
-                            />
-                        </Form.Group>
-                    </Col>
-                )}
+                {initialContents || <Col>
+                        <Form.Group className="mb-3">
+                            <Form.Label htmlFor="id">Id</Form.Label>
+                            <Form.Control data-testid="HelpRequestForm-id" id="id" type="text" {...register("id")} value={initialContents.id} disabled />
+                        </Form.Group>
+                    </Col>}
 
                 <Col>
killedBy: HelpRequestForm tests renders correctly with no initialContents
statusReason: TypeError: Cannot read properties of undefined (reading 'id')

[Killed] StringLiteral
main/components/HelpRequest/HelpRequestForm.js:58:43
                             type="text"
                             isInvalid={Boolean(errors.requesterEmail)}
                             {...register("requesterEmail", {
-                                required: "Requester Email is required."
+                                required: ""
                             })}
                         />
killedBy: HelpRequestForm tests that the correct validations are performed
statusReason: Error: Unable to find an element with the text: /Requester Email is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ObjectLiteral
main/components/HelpRequest/HelpRequestForm.js:98:65
                             id="tableOrBreakoutRoom"
                             type="text"
                             isInvalid={Boolean(errors.tableOrBreakoutRoom)}
-                            {...register("tableOrBreakoutRoom", {
-                                required: "Table Or Breakout Room is required."
-                            })}
+                            {...register("tableOrBreakoutRoom", {})}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: HelpRequestForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Table Or Breakout Room is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/HelpRequest/HelpRequestForm.js:121:30
                             {...register("requestTime", { required: true, pattern: isodate_regex })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.requestTime && 'Request time is required and must be provided in ISO format. '}
+                            {true}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: HelpRequestForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Request time is required and must be provided in ISO format./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] LogicalOperator
main/components/HelpRequest/HelpRequestForm.js:121:30
                             {...register("requestTime", { required: true, pattern: isodate_regex })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.requestTime && 'Request time is required and must be provided in ISO format. '}
+                            {errors.requestTime || 'Request time is required and must be provided in ISO format. '}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: HelpRequestForm tests that the correct validations are performed
statusReason: Error: Objects are not valid as a React child (found: object with keys {type, message, ref}). If you meant to render a collection of children, use an array instead.
