[Killed] BlockStatement
main/components/HelpRequest/HelpRequestTable.js:13:36
 
     const navigate = useNavigate();
 
-    const editCallback = (cell) => {
-        navigate(`/HelpRequest/edit/${cell.row.values.id}`)
-    }
+    const editCallback = (cell) => {}
 
     // Stryker disable all : hard to test for query caching
killedBy: HelpRequestTable tests Edit button navigates to the edit page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/HelpRequest/edit/1"

Number of calls: 0

<html>
  <head />

[Killed] StringLiteral
main/components/HelpRequest/HelpRequestTable.js:14:18
     const navigate = useNavigate();
 
     const editCallback = (cell) => {
-        navigate(`/HelpRequest/edit/${cell.row.values.id}`)
+        navigate(``)
     }
 
killedBy: HelpRequestTable tests Edit button navigates to the edit page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/HelpRequest/edit/1"
Received: ""

Number of calls: 1

<html>

[Killed] ObjectLiteral
main/components/HelpRequest/HelpRequestTable.js:35:9
             Header: 'id',
             accessor: 'id', // accessor is the "key" in the data
         },
-        {
-            Header: 'Requester Email',
-            accessor: 'requesterEmail',
-        },
+        {},
         {
             Header: 'Team ID',
killedBy: HelpRequestTable tests renders empty table correctly
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/HelpRequest/HelpRequestTable.js:36:21
             accessor: 'id', // accessor is the "key" in the data
         },
         {
-            Header: 'Requester Email',
+            Header: "",
             accessor: 'requesterEmail',
         },
killedBy: HelpRequestTable tests renders empty table correctly
statusReason: TestingLibraryElementError: Unable to find an element with the text: Requester Email. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] StringLiteral
main/components/HelpRequest/HelpRequestTable.js:48:21
             accessor: 'tableOrBreakoutRoom',
         },
         {
-            Header: 'Request Time',
+            Header: "",
             accessor: 'requestTime',
         },
killedBy: HelpRequestTable tests renders empty table correctly
statusReason: TestingLibraryElementError: Unable to find an element with the text: Request Time. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] StringLiteral
main/components/HelpRequest/HelpRequestTable.js:49:23
         },
         {
             Header: 'Request Time',
-            accessor: 'requestTime',
+            accessor: "",
         },
         {
killedBy: HelpRequestTable tests Has the expected column headers, content and buttons for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="HelpRequestTable-cell-row-0-col-requestTime"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] StringLiteral
main/components/HelpRequest/HelpRequestTable.js:53:23
         },
         {
             Header: 'Explanation',
-            accessor: 'explanation',
+            accessor: "",
         },
         {
killedBy: HelpRequestTable tests Has the expected column headers, content and buttons for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="HelpRequestTable-cell-row-0-col-explanation"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] BlockStatement
main/components/HelpRequest/HelpRequestTable.js:61:45
         }
     ];
 
-    if (hasRole(currentUser, "ROLE_ADMIN")) {
-        columns.push(ButtonColumn("Edit", "primary", editCallback, "HelpRequestTable"));
-        columns.push(ButtonColumn("Delete", "danger", deleteCallback, "HelpRequestTable"));
-    } 
+    if (hasRole(currentUser, "ROLE_ADMIN")) {} 
 
     const updatedHelpRequests = helpRequests.map(obj => ({
killedBy: HelpRequestTable tests Has the expected column headers, content and buttons for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="HelpRequestTable-cell-row-0-col-Edit-button"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] StringLiteral
main/components/HelpRequest/HelpRequestTable.js:62:35
     ];
 
     if (hasRole(currentUser, "ROLE_ADMIN")) {
-        columns.push(ButtonColumn("Edit", "primary", editCallback, "HelpRequestTable"));
+        columns.push(ButtonColumn("", "primary", editCallback, "HelpRequestTable"));
         columns.push(ButtonColumn("Delete", "danger", deleteCallback, "HelpRequestTable"));
     } 
killedBy: HelpRequestTable tests renders empty table correctly
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ArrowFunction
main/components/HelpRequest/HelpRequestTable.js:66:50
         columns.push(ButtonColumn("Delete", "danger", deleteCallback, "HelpRequestTable"));
     } 
 
-    const updatedHelpRequests = helpRequests.map(obj => ({
-        ...obj,
-        "solved": String(obj["solved"])
-    }));
+    const updatedHelpRequests = helpRequests.map(() => undefined);
 
     return <OurTable
killedBy: HelpRequestTable tests Has the expected column headers, content and buttons for admin user
statusReason: TypeError: Cannot read properties of undefined (reading 'subRows')
