[Killed] BlockStatement
src/main/utils/HelpRequestUtils.js:8:47
     toast(message);
 }
 
-export function cellToAxiosParamsDelete(cell) {
-    return {
-        url: "/api/HelpRequest",
-        method: "DELETE",
-        params: {
-            id: cell.row.values.id
-        }
-    }
-}
+export function cellToAxiosParamsDelete(cell) {}
 
killedBy: HelpRequestUtils cellToAxiosParamsDelete It returns the correct params
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"method": "DELETE", "params": {"id": 17}, "url": "/api/HelpRequest"}
Received: undefined

[Killed] StringLiteral
src/main/utils/HelpRequestUtils.js:11:17
 export function cellToAxiosParamsDelete(cell) {
     return {
         url: "/api/HelpRequest",
-        method: "DELETE",
+        method: "",
         params: {
             id: cell.row.values.id
killedBy: HelpRequestUtils cellToAxiosParamsDelete It returns the correct params
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "method": "DELETE",
+   "method": "",
